zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_rcu.c
/*!
    \file    gd32c2x1_rcu.c
    \brief   RCU driver

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32c2x1_rcu.h"

/* define clock source */
#define SEL_IRC48MDIV      0x00U
#define SEL_HXTAL          0x01U
#define SEL_IRC32K         0x02U
#define SEL_LXTAL          0x03U

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT         ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT       ((uint32_t)0x03FFFFFFU)

/*!
    \brief      deinitialize the RCU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC48M */
    RCU_CTL0 |= RCU_CTL0_IRC48MEN;
    while(0U == (RCU_CTL0 & RCU_CTL0_IRC48MSTB)) {
    }
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    /* reset CTL register */
    RCU_CTL0 &= ~(RCU_CTL0_HXTALEN | RCU_CTL0_HXTALBPS );
    /* reset CTL register */
    RCU_CTL0 &= ~(RCU_CTL0_HXTALEN | RCU_CTL0_CKMEN  | RCU_CTL0_HXTALBPS );
    /* reset RCU_CFG0 register */
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC  | RCU_CFG0_APBPSC | \
                   RCU_CFG0_CKOUT0SEL | RCU_CFG0_CKOUT0DIV |RCU_CFG0_CKOUT0SEL | RCU_CFG0_CKOUT0DIV );
    /* reset RCU_CFG1 register */
    RCU_CFG1 &= ~(RCU_CFG1_USART0SEL | RCU_CFG1_I2C0SEL | RCU_CFG1_I2C1SEL | RCU_CFG1_ADCSEL | \
                  RCU_CFG1_ADCPSC | RCU_CFG1_I2SSEL);
    RCU_INT = 0x00000000U;
}

/*!
    \brief      enable the peripherals clock (API_ID(0x0002U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FMC: FMC clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_DMA: DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_GPIOx (x=A,B,C,D,F): GPIO ports clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_ADC: ADC clock
      \arg        RCU_TIMERx (x=0,2,13,15,16): TIMER clock
      \arg        RCU_SPIx (x=0,1): SPI clock
      \arg        RCU_USARTx (x=0,1,2): USART clock
      \arg        RCU_I2Cx (x=0,1): I2C clock
      \arg        RCU_DBGMCU: DBGMCU clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_RTC: RTC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock (API_ID(0x0003U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_CRC: CRC clock
      \arg        RCU_DMA: DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_GPIOx (x=A,B,C,D,F): GPIO ports clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_ADC: ADC clock
      \arg        RCU_TIMERx (x=0,1,2,5,13,15,16): TIMER clock
      \arg        RCU_SPIx (x=0,1): SPI clock
      \arg        RCU_USARTx (x=0,1,2): USART clock
      \arg        RCU_I2Cx (x=0,1): I2C clock
      \arg        RCU_DBGMCU: DBGMCU clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_RTC: RTC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the peripherals clock when sleep mode (API_ID(0x0004U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SRAM_SLP: SRAM clock
      \arg        RCU_FMC_SLP: FMC clock
      \arg        RCU_CRC_SLP: CRC clock
      \arg        RCU_DMA_SLP: DMA clock 
      \arg        RCU_DMAMUX_SLP: DMAMUX clock
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,F): GPIO ports clock
      \arg        RCU_SYSCFG_SLP: SYSCFG clock
      \arg        RCU_CMP_SLP: CMP clock
      \arg        RCU_WWDGT_SLP: WWDGT clock
      \arg        RCU_ADC_SLP: ADC clock
      \arg        RCU_TIMERx_SLP (x=0,2,13,15,16): TIMER clock
      \arg        RCU_SPIx_SLP (x = 0,1): SPI clock
      \arg        RCU_USARTx_SLP (x = 0,1,2): USART clock
      \arg        RCU_I2Cx_SLP (x = 0,1): I2C clock
      \arg        RCU_PMU_SLP: PMU clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock when sleep mode (API_ID(0x0005U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SRAM_SLP: SRAM clock
      \arg        RCU_FMC_SLP: FMC clock
      \arg        RCU_CRC_SLP: CRC clock
      \arg        RCU_DMA_SLP: DMA clock 
      \arg        RCU_DMAMUX_SLP: DMAMUX clock
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,F): GPIO ports clock
      \arg        RCU_SYSCFG_SLP: SYSCFG clock
      \arg        RCU_CMP_SLP: CMP clock
      \arg        RCU_WWDGT_SLP: WWDGT clock
      \arg        RCU_ADC_SLP: ADC clock
      \arg        RCU_TIMERx_SLP (x=0,2,13,15,16): TIMER clock
      \arg        RCU_SPIx_SLP (x = 0,1): SPI clock
      \arg        RCU_USARTx_SLP (x = 0,1,2): USART clock
      \arg        RCU_I2Cx_SLP (x = 0,1): I2C clock
      \arg        RCU_PMU_SLP: PMU clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}
/*!
    \brief      reset the peripherals (API_ID(0x0006U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_CRCRST: reset CRC
      \arg        RCU_DMARST: reset DMA
      \arg        RCU_DMAMUXRST: reset DMAMUX
      \arg        RCU_GPIOxRST (x = A,B,C,D,F): reset GPIO ports
      \arg        RCU_SYSCFGRST: reset SYSCFG
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_ADCRST: reset ADC
      \arg        RCU_TIMERxRST (x=0,2,13,15,16): reset TIMER
      \arg        RCU_SPIxRST (x = 0,1): reset SPI
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_I2CxRST (x = 0,1): reset I2C
      \arg        RCU_PMURST: reset PMU
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripheral (API_ID(0x0007U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_CRCRST: reset CRC
      \arg        RCU_DMARST: reset DMA
      \arg        RCU_DMAMUXRST: reset DMAMUX
      \arg        RCU_GPIOxRST (x = A,B,C,D,F): reset GPIO ports
      \arg        RCU_SYSCFGRST: reset SYSCFG
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_ADCRST: reset ADC
      \arg        RCU_TIMERxRST (x=0,2,13,15,16): reset TIMER
      \arg        RCU_SPIxRST (x = 0,1): reset SPI
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_I2CxRST (x = 0,1): reset I2C
      \arg        RCU_PMURST: reset PMU
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      reset the BKP (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_enable(void)
{
    RCU_CTL1 |= RCU_CTL1_BKPRST;
}

/*!
    \brief      disable the BKP reset (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_disable(void)
{
    RCU_CTL1 &= ~RCU_CTL1_BKPRST;
}

/*!
    \brief      configure the system clock source (API_ID(0x000CU))
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC48MDIV_SYS: select IRC48MDIV_SYS as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_IRC32K: select IRC32K as the CK_SYS source
      \arg        RCU_CKSYSSRC_LXTAL: select LXTLA as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t cksys_source;
    cksys_source = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    cksys_source &= ~RCU_CFG0_SCS;
    RCU_CFG0 = ((ck_sys & RCU_CFG0_SCS) | cksys_source);
}

/*!
    \brief      get the system clock source (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     which clock is selected as CK_SYS source
      \arg        RCU_CKSYSSRC_IRC48MDIV_SYS: select IRC48MDIV_SYS as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_IRC32K: select IRC32K as the CK_SYS source
      \arg        RCU_CKSYSSRC_LXTAL: select LXTLA as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    return (RCU_CFG0 & RCU_CFG0_SCSS);
}

/*!
    \brief      configure the AHB clock prescaler selection (API_ID(0x000EU))
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx, x=1, 2, 4, 8, 16, 64, 128, 256, 512: select CK_SYS/x as CK_AHB
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t ahbpsc;
    ahbpsc = RCU_CFG0;
    /* reset the AHBPSC bits and set according to ck_ahb */
    ahbpsc &= ~RCU_CFG0_AHBPSC;
    RCU_CFG0 = ((ck_ahb & RCU_CFG0_AHBPSC) | ahbpsc);
}


/*!
    \brief      configure the APB clock prescaler selection (API_ID(0x000FU))
    \param[in]  ck_apb: APB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB_CKAHB_DIV1: select CK_AHB as CK_APB
      \arg        RCU_APB_CKAHB_DIV2: select CK_AHB/2 as CK_APB
      \arg        RCU_APB_CKAHB_DIV4: select CK_AHB/4 as CK_APB
      \arg        RCU_APB_CKAHB_DIV8: select CK_AHB/8 as CK_APB
      \arg        RCU_APB_CKAHB_DIV16: select CK_AHB/16 as CK_APB
    \param[out] none
    \retval     none
*/
void rcu_apb_clock_config(uint32_t ck_apb)
{
    uint32_t apbpsc;
    apbpsc = RCU_CFG0;
    /* reset the APBPSC and set according to ck_apb */
    apbpsc &= ~RCU_CFG0_APBPSC;
    RCU_CFG0 = ((ck_apb & RCU_CFG0_APBPSC) | apbpsc);
}

/*!
    \brief      configure the ADC clock source and prescaler selection (API_ID(0x0010U))
    \param[in]  adc_clock_source: ADC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCSRC_CKSYS: ADC clock source select CK_SYS
      \arg        RCU_ADCSRC_IRC48M_PER: ADC clock source select CK_IRC48MDIV_PER
    \param[in]  ck_adc: ADC clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCCK_DIV1: ADC clock prescaler select not divided
      \arg        RCU_ADCCK_DIV2: ADC clock prescaler select divided by 2
      \arg        RCU_ADCCK_DIV4: ADC clock prescaler select divided by 4
      \arg        RCU_ADCCK_DIV6: ADC clock prescaler select divided by 6
      \arg        RCU_ADCCK_DIV8: ADC clock prescaler select divided by 8
      \arg        RCU_ADCCK_DIV10: ADC clock prescaler select divided by 10
      \arg        RCU_ADCCK_DIV12: ADC clock prescaler select divided by 12
      \arg        RCU_ADCCK_DIV16: ADC clock prescaler select divided by 16
      \arg        RCU_ADCCK_DIV32: ADC clock prescaler select divided by 32
      \arg        RCU_ADCCK_DIV64: ADC clock prescaler select divided by 64
      \arg        RCU_ADCCK_DIV128: ADC clock prescaler select divided by 128
      \arg        RCU_ADCCK_DIV256: ADC clock prescaler select divided by 256
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(uint32_t adc_clock_source, uint32_t ck_adc)
{
    uint32_t cfg1_val;

    /* Read the current value of RCU_CFG1 */
    cfg1_val = RCU_CFG1;

    /* Reset the ADCPSC and ADCSEL bits */
    cfg1_val &= ~RCU_CFG1_ADCPSC;
    cfg1_val &= ~RCU_CFG1_ADCSEL;

