zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_rcu.c
    /* Set the ADC clock source according to adc_clock_source */
    cfg1_val |= (adc_clock_source & RCU_CFG1_ADCSEL);

    /* Set the ADC clock prescaler according to ck_adc */
    cfg1_val |= (ck_adc & RCU_CFG1_ADCPSC);

    /* Write back the modified value to RCU_CFG1 */
    RCU_CFG1 = cfg1_val;
}

/*!
    \brief      configure the CK_OUT0 clock source and divider (API_ID(0x0012U))
    \param[in]  ckout_src: CK_OUT0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT0SRC_NONE:   no clock selected
      \arg        RCU_CKOUT0SRC_CKSYS:  CK_OUT0 clock source select CKSYS
      \arg        RCU_CKOUT0SRC_IRC48M: CK_OUT0 clock source select IRC48M
      \arg        RCU_CKOUT0SRC_HXTAL:  CK_OUT0 clock source select HXTAL
      \arg        RCU_CKOUT0SRC_IRC32K: CK_OUT0 clock source select IRC32K
      \arg        RCU_CKOUT0SRC_LXTAL:  CK_OUT0 clock source select LXTAL
    \param[in]  ckout_div: CK_OUT0 divider
      \arg        RCU_CKOUT0_DIVx(x=1,2,4,8,16,32,64,128): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout0_config(uint32_t ckout0_src, uint32_t ckout0_div)
{
    uint32_t ckout;
    ckout = RCU_CFG0;
    /* reset the CKOUT0SEL and CKOUT0DIV bits and set according to ckout_src and ckout_div */
    ckout &= ~(RCU_CFG0_CKOUT0SEL | RCU_CFG0_CKOUT0DIV );
    RCU_CFG0 = (ckout | (ckout0_src & RCU_CFG0_CKOUT0SEL) | (ckout0_div & RCU_CFG0_CKOUT0DIV));
}

/*!
    \brief      configure the CK_OUT1 clock source and divider (API_ID(0x0013U))
    \param[in]  ckout_src: CK_OUT1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT1SRC_NONE:   no clock selected
      \arg        RCU_CKOUT1SRC_CKSYS:  CK_OUT1 clock source select CKSYS
      \arg        RCU_CKOUT1SRC_IRC48M: CK_OUT1 clock source select IRC48M
      \arg        RCU_CKOUT1SRC_HXTAL:  CK_OUT1 clock source select HXTAL
      \arg        RCU_CKOUT1SRC_IRC32K: CK_OUT1 clock source select IRC32K
      \arg        RCU_CKOUT1SRC_LXTAL:  CK_OUT1 clock source select LXTAL
    \param[in]  ckout_div: CK_OUT divider
      \arg        RCU_CKOUT1_DIVx(x=1,2,4,8,16,32,64,128): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div)
{
    uint32_t ckout;
    ckout = RCU_CFG0;
    /* reset the CKOUT1SEL and CKOUT1DIV bits and set according to ckout_src and ckout_div */
    ckout &= ~(RCU_CFG0_CKOUT1SEL | RCU_CFG0_CKOUT1DIV );
    RCU_CFG0 = (ckout | (ckout1_src & RCU_CFG0_CKOUT1SEL) | (ckout1_div | RCU_CFG0_CKOUT1DIV));
}

/*!
    \brief      enable the low speed clock output (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lsckout_enable(void)
{
    RCU_CTL1 |= RCU_CTL1_LSCKOUTEN;
}

/*!
    \brief      disable the low speed clock output (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lsckout_disable(void)
{
    RCU_CTL1 &= ~RCU_CTL1_LSCKOUTEN;
}

/*!
    \brief      configure the LSCKOUT clock source (API_ID(0x0016U))
    \param[in]  lsc_ckout_src: LSCKOUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_LSCKOUTSRC_IRC32K: IRC32K clock selected
      \arg        RCU_LSCKOUTSRC_LXTAL: LXTAL selected
    \param[out] none
    \retval     none
*/
void rcu_lsckout_config(uint32_t lsckout_src)
{
    uint32_t reg;

    reg = RCU_CTL1;
    /* reset the LSCKOUTSEL */
    reg &= ~(RCU_CTL1_LSCKOUTSEL);
    RCU_CTL1 = (reg | (lsckout_src & (RCU_CTL1_LSCKOUTSEL)));
}

/*!
    \brief      configure the USART clock source selection (API_ID(0x0017U))
    \param[in]  usart_idx: IDX_USART0
    \param[in]  ck_usart: USART clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USART0SRC_CKAPB: CK_USART select CK_APB
      \arg        RCU_USART0SRC_CKSYS: CK_USART select CK_SYS
      \arg        RCU_USART0SRC_IRC48MDIV_PER: CK_USART select CK_IRC48MDIV_PER
      \arg        RCU_USART0SRC_LXTAL: CK_USART select LXTAL
    \param[out] none
    \retval     none
*/
void rcu_usart_clock_config(usart_idx_enum usart_idx, uint32_t ck_usart)
{
    switch(usart_idx) {
    case IDX_USART0:
        {
            uint32_t reg_val = RCU_CFG1;
            /* reset the USART0SEL bits and set according to ck_usart */
            reg_val &= ~RCU_CFG1_USART0SEL;
            reg_val |= (ck_usart & RCU_CFG1_USART0SEL);
            RCU_CFG1 = reg_val;
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the I2Cx(x=0,1) clock source selection (API_ID(0x0018U))
    \param[in]  i2c_idx: IDX_I2Cx(x=0,1)
    \param[in]  ck_i2c: I2C clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2CSRC_CKAPB: CK_I2C select CK_APB
      \arg        RCU_I2CSRC_CKSYS: CK_I2C select CK_SYS
      \arg        RCU_I2CSRC_IRC48MDIV_PER: CK_I2C select CK_IRC48MDIV_PER
    \param[out] none
    \retval     none
*/
void rcu_i2c_clock_config(i2c_idx_enum i2c_idx, uint32_t ck_i2c)
{
    switch(i2c_idx) {
    case IDX_I2C0:
        {
        uint32_t reg_val = RCU_CFG1;
        /* reset the I2C0SEL bits and set according to ck_i2c */
        reg_val &= ~RCU_CFG1_I2C0SEL;
        reg_val |= (ck_i2c & RCU_CFG1_I2C0SEL);
        RCU_CFG1 = reg_val;
        }
        break;
    case IDX_I2C1:
        {
        uint32_t reg_val = RCU_CFG1;
        /* reset the I2C1SEL bits and set according to ck_i2c */
        reg_val &= ~RCU_CFG1_I2C1SEL;
        reg_val |= ((uint32_t)ck_i2c & RCU_CFG1_I2C0SEL) << 2U;
        RCU_CFG1 = reg_val;
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the I2S clock source selection (API_ID(0x0019U))
    \param[in]  ck_i2s: I2S clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2SSRC_CKSYS: CK_I2S select CK_SYS
      \arg        RCU_I2SSRC_IRC48MDIV_PER: CK_I2S select IRC48MDIV_PER
      \arg        RCU_I2SSRC_CKIN: CK_I2S select I2S_CKIN
    \param[out] none
    \retval     none
*/
void rcu_i2s_clock_config(uint32_t ck_i2s)
{
    uint32_t reg_val = RCU_CFG1;
    /* reset the I2SSEL bits and set according to ck_i2s */
    reg_val &= ~RCU_CFG1_I2SSEL;
    reg_val |= (ck_i2s & RCU_CFG1_I2SSEL);
    RCU_CFG1 = reg_val;
}

/*!
    \brief      configure the IRC48MDIV_SYS clock selection (API_ID(0x001AU))
    \param[in]  ck_irc48mdiv_sys: IRC48MDIV clock selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC48MDIV_SYS_1: CK_IRC48MDIV_SYS select CK_IRC48M
      \arg        RCU_IRC48MDIV_SYS_2: CK_IRC48MDIV_SYS select CK_IRC48M divided by 2
      \arg        RCU_IRC48MDIV_SYS_4: CK_IRC48MDIV_SYS select CK_IRC48M divided by 4
      \arg        RCU_IRC48MDIV_SYS_8: CK_IRC48MDIV_SYS select CK_IRC48M divided by 8
      \arg        RCU_IRC48MDIV_SYS_16: CK_IRC48MDIV_SYS select CK_IRC48M divided by 16
      \arg        RCU_IRC48MDIV_SYS_32: CK_IRC48MDIV_SYS select CK_IRC48M divided by 32
      \arg        RCU_IRC48MDIV_SYS_64: CK_IRC48MDIV_SYS select CK_IRC48M divided by 64
      \arg        RCU_IRC48MDIV_SYS_128: CK_IRC48MDIV_SYS select CK_IRC48M divided by 128

    \param[out] none
    \retval     none
*/
void rcu_irc48mdiv_sys_clock_config(uint32_t ck_irc48mdiv_sys)
{
    uint32_t reg_val = RCU_CTL0;
    /* reset the IRC48MDIV_SYS bits and set according to ck_irc48mdiv_sys */
    reg_val &= ~RCU_CTL0_IRC48MDIV_SYS;
    reg_val |= (ck_irc48mdiv_sys & RCU_CTL0_IRC48MDIV_SYS);
    RCU_CTL0 = reg_val;
}


/*!
    \brief      configure the IRC48MDIV clock selection (API_ID(0x001BU))
    \param[in]  ck_irc48mdiv_per: IRC48MDIV clock selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC48MDIV_PER_1: CK_IRC48MDIV_PER select CK_IRC48M
      \arg        RCU_IRC48MDIV_PER_2: CK_IRC48MDIV_PER select CK_IRC48M divided by 2
      \arg        RCU_IRC48MDIV_PER_3: CK_IRC48MDIV_PER select CK_IRC48M divided by 3
      \arg        RCU_IRC48MDIV_PER_4: CK_IRC48MDIV_PER select CK_IRC48M divided by 4
      \arg        RCU_IRC48MDIV_PER_5: CK_IRC48MDIV_PER select CK_IRC48M divided by 5
      \arg        RCU_IRC48MDIV_PER_6: CK_IRC48MDIV_PER select CK_IRC48M divided by 6
      \arg        RCU_IRC48MDIV_PER_7: CK_IRC48MDIV_PER select CK_IRC48M divided by 7
      \arg        RCU_IRC48MDIV_PER_8: CK_IRC48MDIV_PER select CK_IRC48M divided by 8

    \param[out] none
    \retval     none
*/
void rcu_irc48mdiv_per_clock_config(uint32_t ck_irc48mdiv_per)
{
    uint32_t reg_val = RCU_CTL0;
    /* reset the IRC48MDIV_PER bits and set according to ck_irc48mdiv_per */
    reg_val &= ~RCU_CTL0_IRC48MDIV_PER;
    reg_val |= (ck_irc48mdiv_per & RCU_CTL0_IRC48MDIV_PER);
    RCU_CTL0 = reg_val;
}

/*!
    \brief      configure the RTC clock source selection (API_ID(0x001CU))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV32: CK_HXTAL/32 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    uint32_t reg_val = RCU_CTL1;
    reg_val &= ~RCU_CTL1_RTCSRC;
    reg_val |= (rtc_clock_source & RCU_CTL1_RTCSRC);
    RCU_CTL1 = reg_val;
}

/*!
    \brief      configure the LXTAL drive capability (API_ID(0x001DU))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_HIGHDRI: higher driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    uint32_t reg_val = RCU_CTL1;
    reg_val &= ~RCU_CTL1_LXTALDRI;
    reg_val |= (lxtal_dricap & RCU_CTL1_LXTALDRI);
    RCU_CTL1 = reg_val;
}

/*!
    \brief      wait until oscillator stabilization flags is SET (API_ID(0x001EU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;
    switch(osci) {
    case RCU_HXTAL:
        /* wait until HXTAL is stabilization and osci_stat is not more than timeout */
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;

