zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_rcu.c
    /* wait LXTAL stable */
    case RCU_LXTAL:
        while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_LXTALSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_LXTALSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait IRC48M stable */
    case RCU_IRC48M:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC48MSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC48MSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait IRC32K stable */
    case RCU_IRC32K:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC32KSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC32KSTB)) {
            reval = SUCCESS;
        }
        break;

    default:
        break;
    }
    /* return value */
    return reval;
}

/*!
    \brief      turn on the oscillator (API_ID(0x001FU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      turn off the oscillator (API_ID(0x0022U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x0023U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci)
{
    uint32_t reg;
    switch(osci) {
    case RCU_HXTAL:
        /* HXTALEN must be reset before enable the oscillator bypass mode */
        reg = RCU_CTL0;
        RCU_CTL0 &= ~RCU_CTL0_HXTALEN;
        RCU_CTL0 = (reg | RCU_CTL0_HXTALBPS);
        break;
    case RCU_LXTAL:
        /* LXTALEN must be reset before enable the oscillator bypass mode */
        reg = RCU_CTL1;
        RCU_CTL1 &= ~RCU_CTL1_LXTALEN;
        RCU_CTL1 = (reg | RCU_CTL1_LXTALBPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x0024U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci)
{
    uint32_t reg;
    switch(osci) {
    case RCU_HXTAL:
        /* HXTALEN must be reset before disable the oscillator bypass mode */
        reg = RCU_CTL0;
        RCU_CTL0 &= ~RCU_CTL0_HXTALEN;
        RCU_CTL0 = (reg & (~RCU_CTL0_HXTALBPS));
        break;
    case RCU_LXTAL:
        /* LXTALEN must be reset before disable the oscillator bypass mode */
        reg = RCU_CTL1;
        RCU_CTL1 &= ~RCU_CTL1_LXTALEN;
        RCU_CTL1 = (reg & (~RCU_CTL1_LXTALBPS));
        break;
    default:
        break;
    }
}

/*!
    \brief      set the IRC48M adjust value (API_ID(0x0025U))
    \param[in]  irc48m_adjval: IRC48M adjust value, must be between 0 and 0x3F
    \param[out] none
    \retval     none
*/
void rcu_irc48m_adjust_value_set(uint8_t irc48m_adjval)
{
    uint32_t adjust;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_IRC48M_ADJ(irc48m_adjval)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        adjust = RCU_CTL0;
        /* reset the IRC48MADJ bits and set according to irc48m_adjval */
        adjust &= ~RCU_CTL0_IRC48MADJ;
        RCU_CTL0 = (adjust | (((uint32_t)irc48m_adjval) << 2U));
    }
}

/*!
    \brief      enable LXTAL stabilization reset (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_stab_reset_enable(void)
{
    RCU_CTL1 |= RCU_CTL1_LXTALSTBRST;
}

/*!
    \brief      disable LXTAL stabilization reset (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_stab_reset_disable(void)
{
    RCU_CTL1 &= ~RCU_CTL1_LXTALSTBRST;
}

/*!
    \brief      enable the HXTAL clock monitor (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL0 |= RCU_CTL0_CKMEN;
}

/*!
    \brief      disable the HXTAL clock monitor (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL0 &= ~RCU_CTL0_CKMEN;
}

/*!
    \brief      enable the LXTAL clock monitor (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_enable(void)
{
    RCU_CTL1 |= RCU_CTL1_LCKMEN;
}

/*!
    \brief      disable the LXTAL clock monitor (API_ID(0x002BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_disable(void)
{
    RCU_CTL1 &= ~RCU_CTL1_LCKMEN;
}


/*!
    \brief      get the system clock, bus and peripheral clock frequency (API_ID(0x002CU))
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB: APB clock frequency
      \arg        CK_ADC: ADC clock frequency
      \arg        CK_USART0: USART0 clock frequency
    \param[out] none
    \retval     clock frequency of system, AHB, APB, ADC or USRAT0
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U;
    uint32_t cksys_freq, ahb_freq, apb_freq, irc48m_per_freq;
    uint32_t adc_freq, usart_freq;
    uint32_t idx, clk_exp;
    /* exponent of AHB, APB, ADC clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t apb_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t IRC48M_exp[8] = {0, 1, 2, 3, 4, 5, 6, 7};
    const uint8_t irc48m_per_exp[8] = {1, 2, 3, 4, 5, 6, 7, 8};
    const uint16_t adc_exp[12] = {1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256};
    
    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws) {
    /* IRC48M is selected as CK_SYS */
    case SEL_IRC48MDIV:
        idx = GET_BITS(RCU_CTL0, 29, 31);
        clk_exp = IRC48M_exp[idx];
        cksys_freq = IRC48M_VALUE >> clk_exp ;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* IRC32k is selected as CK_SYS */
    case SEL_IRC32K:
        cksys_freq = IRC32K_VALUE;
        break;
    /* LXTAL is selected as CK_SYS */
    default:
        cksys_freq = LXTAL_VALUE;
        break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;
    
